Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: No typed variables: Variables have no explicitly defined type; instead, a value of any type can be stored in any variable (excluding built-in variables).
fr: Pas de variables typées : Les variables n'ont pas de type défini explicitement ; à la place, une valeur de type quelconque peut être stockée dans n'importe quelle variable (sauf les variables intégrées).

source: Note: Installer.ahk must be run as admin to work correctly.
fr: Note : Installer.ahk doit être exécuté en tant qu'administrateur pour fonctionner correctement.

source: Note: Only a plain variable can be used as an OutputVar.
fr: Note : Seule une simple variable peut être utilisée pour VarSortie.

source: Note: Only a plain variable name can be used.
fr: Note : Seul un simple nom de variable peut être utilisé.

source: Note: Some of the most common problems are caused by changes required to support Unicode text, and can be avoided by simply using the ANSI version of AutoHotkey_L.
fr: Remarque: Certains des problèmes les plus courants sont causés par les modifications requises pour prendre en charge le texte Unicode et peuvent être évités en utilisant simplement la version ANSI d'AutoHotkey_L.

source: Note: Subroutines defined inside a function have certain limitations regarding the use of local variables and dynamic variable references, including Gui control variables.
fr: Note : Les sous-programmes définis dans une fonction ont certaines limitations sur l'utilisation des variables locales et des références dynamiques de variable, y compris les variables de contrôle de Gui.

source: Note: The following paragraphs detail some common points of confusion.
fr: Note : Les paragraphes suivants détaillent des sources courantes de confusion.

source: Note: There are exceptions, but those tend to cause confusion a lot of the time.
fr: Note : Il y a des exceptions, mais elles rendent souvent les choses trop confuses.

source: Note: There are several different forms of Send.
fr: Note : Il y a différentes formes de Send.

source: Note: There must not be any space between the function name and open parenthesis.
fr: Note : Il ne doit pas y avoir d'espace entre le nom de la fonction et la parenthèse ouvrante.

source: Note: Using the percent-space prefix in a numeric parameter does not necessarily force it to be an expression.
fr: Note : Utiliser le préfixe pourcentage-espace dans un paramètre numérique ne le force pas forcément à être une expression.

source: Note: Variable names are not always enclosed in percent signs; they are required only within unquoted text.
fr: Note : Les noms de variables ne sont pas toujours entourés de signes pourcentage ; ils ne sont requis que dans du texte sans guillemets.

source: Note: While compressing the script executable prevents casual inspection of the script's source code using a plain text editor like Notepad or a PE resource editor, it does not prevent the source code from being extracted by tools dedicated to that purpose.
fr: Note : Bien que la compression du script exécutable empêche d'explorer simplement le code source du script avec un éditeur de texte brut comme Notepad ou un éditeur de ressource PE, elle n'empêche pas le code source d'être extrait par des outils spécifiques.

source: Note: While the script's first hotkey/hotstring label has the same effect as return, other hotkeys and labels do not.
fr: Note : Alors que le premier hotkey/hotstring du script a le même effet qu'un return, ce n'est pas le cas des autres hotkeys et labels.

source: Note: Windows IME may interfere with the detection and functionality of CapsLock; see CapsLock and IME for details.
fr: Remarque: Windows IME peut interférer avec la détection et la fonctionnalité de VerrMaj; veuillez consulter VerrMaj et IME pour les détails.

source: Note:
fr: Remarque:

source: Older, less reliable method: The technique in the following example will work with MS Internet Explorer for most pages.
fr: Méthode plus vieille, moins fiable : La technique dans l'exemple suivant fonctionnera avec MS Internet Explorer pour la plupart des pages.

source: Other: The suggestions above cover the most common problems.
fr: Autre : Les suggestions ci-dessus couvrent les problèmes les plus courants.

source: RTrim0 (RTrim followed by a zero):
fr: RTrim0 (RTrim suivi d'un zéro) :

source: Restart scripts [v1.1.19.02+]:
fr: Relancer les scripts [v1.1.19.02+] :

source: Reverse direction:
fr: Inverser la direction:

source: Right-click:
fr: Clic droit :

source: Script Filename: This can be omitted if there are no Script Parameters.
fr: Nom de Fichier du Script : Ceci peut être omis si il n'y a pas de Paramètres de Script.

source: Script Parameters: The string(s) you want to pass into the script, with each separated from the next by a space.
fr: Paramètres du Script : Le(s) chaîne(s) de caractères à passer au script, chacune séparée de la suivante par un espace.

source: See Also:
fr: Voir aussi:

source: Setup hangs: If the setup window comes up blank or not at all, try one or both of the following:
fr: L'installation traîne : Si la fenêtre d'installation s'affiche blanche ou pas du tout, essayer une ou les deux des solutions suivantes :

source: Spaces are mostly ignored: Indentation (leading space) is important for writing readable code, but is not required by the program and is generally ignored.
fr: Les espaces sont pour la plupart ignorés : L'indentation (l'espacement au début) est important pour écrire du code lisible, mais n'est pas requise par le programme et est en général ignorée.

source: StringLower, OutputVar, InputVar , T
fr: StringLower, VarSortie, VarEntree , T

source: Switches: Zero or more of the following:
fr: Commutateurs : Zéro ou plus des commutateurs suivants :

source: Taskbar buttons [v1.1.08+]:
fr: Boutons en barre des tâches [v1.1.08+] :

source: This is important: A lot of games, especially modern ones, have cheat prevention software.
fr: Important : Beaucoup de jeux, surtout les plus modernes, sont muni d'outils anti-triche.

source: Tip: If your browser supports it, you can download any code block (such as the one above) as a script file by clicking the button which appears in the top-right of the code block when you hover your mouse over it.
fr: Conseil : Si le navigateur le permet, il est possible de télécharger n'importe quel bloc de code (comme celui ci-dessus) en tant que fichier de script en cliquant le bouton qui apparait en haut à droite du bloc de code quand la souris est dessus.

source: Uninstall:
fr: Désinstallation:

source: Warning: Only Send, GetKeyName(), GetKeyVK(), GetKeySC() and #MenuMaskKey support combining VKnn and SCnnn.
fr: Avertissement: Seulement Send, GetKeyName(), GetKeyVK(), GetKeySC() and #MenuMaskKey supporte la combinaison de VKnn et SCnnn.

source: [AHK_L 11+]: Connect to a debugging client.
fr: [AHK_L 11+] : Se connecter à un client de débogage.

source: [AHK_L 51+]: Overrides the default codepage used to read script files.
fr: [AHK_L 51+] : Remplace la page de code (codepage) par défaut utilisée pour lire les fichiers de script.

source: [AHK_L 51+]: Renaming AutoHotkey.exe also changes which script it runs by default, which can be an alternative to compiling a script for use on a computer without AutoHotkey installed.
fr: [AHK_L 51+]: Renommer AutoHotkey.exe change également quel script est exécuté par défaut, ce qui peut être une alternative à la compilation d'un script pour utilisation sur un ordinateur sans AutoHotkey installé.

source: [AHK_L 59+]: To attach the debugger to a script which is already running, send it a message as shown below:
fr: [AHK_L 59+] : Pour attacher le débogueur à un script déjà en cours d'exécution, lui envoyer un message comme montré ci-dessous :

source: [v1.0.47+]: AutoHotkey loads the script but does not run it.
fr: [v1.0.47+] : AutoHotkey charge le script mais ne l'exécute pas.

source: [v1.0.48+]: Scroll to the left or right.
fr: [v1.0.48+]: Faites défiler vers la gauche ou la droite.

source: [v1.1.17+]: Specify an asterisk (*) for the filename to read the script text from standard input (stdin).
fr: [v1.1.17+] : Indiquer un astérisque (*) pour le nom de fichier pour que le texte du script soit lu depuis l'entrée standard (stdin).

source: [v1.1.24.02+]: For command-line installations, specify /IsHostApp or /IsHostApp=1 to enable the option and /IsHostApp=0 to disable it.
fr: [v1.1.24.02+] : Pour les installations en ligne de commande, spécifier /IsHostApp ou /IsHostApp=1 pour activer l'option et /IsHostApp=0 pour la désactiver.

source: [v1.1.27+]: Incoming parameters, if present, are stored as an array in the built-in variable A_Args, and can be accessed using array syntax.
fr: [v1.1.27+] : Les paramètres d'entrée, si présents, sont stockés sous forme de tableau dans la variable intégrée A_Args, et peuvent être obtenus en utilisant la syntaxe de tableau.

source: [v1.1.27+]: The letters a-z or A-Z can be used to refer to the corresponding virtual keycodes (usually vk41-vk5A) even if they are not included in the current keyboard layout.
fr: [v1.1.27+]: Les lettres a-z ou A-Z peuvent être utilisées pour désigner les codes de touches virtuels correspondants (généralement vk41-vk5A) même s'ils ne sont pas inclus dans la disposition actuelle du clavier.

source: ` (accent):
fr: ` (accent grave) :

source: Z (has Z axis), R (has R axis), U (has U axis), V (has V axis), P (has POV control), D (the POV control has a limited number of discrete/distinct settings), C (the POV control is continuous/fine).
fr: Z (a l'axe Z), R (a l'axe R), U (a l'axe U), V (a l'axe V), P (a la contrôle point-de-vue / POV), D (La contrôle point-de-vue / POV a un nombre limité de paramètres discrètes/distincts), C (la contrôle point-de-vue / POV est continu/fin).

source: or Color = "Black" or Color = "Gray" or Color = "White")
fr: or Couleur = "Noir" or Couleur = "Gris" or Couleur = "Blanc")

source: : ProductIsAvailableInColor(Product, Color)
fr: : ProduitDisponibleDansCetteCouleur(Produit, Couleur)

source: and ProductIsAvailableInColor(Product, Color)
fr: and ProduitDisponibleDansCetteCouleur(Produit, Couleur)

source: [v1.1.27+]: The presence of an invalid suffix prevents VKnn from being recognized.
fr: [v1.1.27+]: La présence d'un suffixe invalide empêche VKnn d'être reconnu.

source: A Loop statement (Loop, While or For) executes its body repeatedly.
fr: Une instruction de boucle (Loop (boucler), While (tant que) ou For (pour)) exécute son corps de manière répétée.

source: A block (denoted by a pair of braces) groups zero or more statements to act as a single statement.
fr: Un bloc (indiqué par une paire d'accolades) regroupe 0 ou plus instructions.

source: A label can be used to "name" a loop for Continue and Break.
fr: Un label (étiquette) peut être utilisé pour "nommer" une boucle pour Continue et Break.

source: A command is an instruction to carry out a specific predefined action.
fr: Une commande est une instruction pour effectuer une action prédéfinie spécifique.

source: A dynamic variable reference takes a text value and interprets it as the name of a variable.
fr: Une référence dynamique de variable prend une valeur textuelle et l'interprète comme le nom d'une variable.

source: A pseudo-array is actually just a bunch of discrete variables, but with a naming pattern which allows them to be used like elements of an array.
fr: Un pseudo-tableau est en fait juste un ensemble de variables distinctes, mais avec un nom suivant un motif leur permettant d'être utilisées comme les éléments d'un tableau.

source: A string, or string of characters, is just a text value.
fr: Une chaîne de caractères (en anglais string), est juste une valeur textuelle.

source: A subroutine (or sub) is a reusable block of code which can be called to perform some task.
fr: Un sous-programme (subroutine, sub) est un bloc de code réutilisable qui peut être appelé pour effectuer des tâches.

source: A literal value is one written physically in the script; one that you can see when you look at the code.
fr: Une valeur littérale est une valeur physiquement écrite dans le script ; une valeur visible en regardant le code.

source: A block counts as a single group of statements, as does a control flow statement and its body.
fr: Un bloc compte comme un unique groupe d'instructions, tout comme une instruction de flux de contrôle avec son corps.

source: A combination of the three expression assignments above.
fr: Une combinaison des trois affectations par expression ci-dessus.

source: A combination of the two legacy assignments above.
fr: Une combinaison des deux affectations dépassées ci-dessus.

source: A command is called simply by writing its name at the beginning of a line, optionally followed by parameters.
fr: Une commande est appelée en écrivant simplement son nom au début d'une ligne, facultativement suivi par des paramètres.

source: A common issue lots of people have is, they assume that the curly brackets are put in the documentation pages just for fun.
fr: Un problème courant est de penser que les accolades mises dans la documentation ne sont là que pour faire joli,

source: A comparison can also be combined with other conditions using operators such as and and or (which are equivalent to && and ||).
fr: Une comparaison peut aussi être combinée avec d'autre conditions en utilisant des opérateurs tels que and (et) et or (ou) (qui sont équivalents à && et ||).

source: A continuation section can be immediately followed by a line containing the open-parenthesis of another continuation section.
fr: Une section de continuation peut être suivie immédiatement d'une ligne contenant la parenthèse ouvrante d'une autre section de continuation.

source: A continuation section cannot produce a line whose total length is greater than 16,383 characters (if it tries, the program will alert you the moment the script is launched).
fr: Une section de continuation ne peut pas produire une ligne dont la longueur totale dépasse 16383 caractères (si cela arrive, le programme émet une alerte au moment de lancer le script).

source: A directory other than the default may be specified via the /D parameter (in the absence of /S, this changes the default directory displayed by the installer).
fr: Un dossier autre que celui par défaut peut être spécifié avec le paramètre /D (en l'absence de /S, ceci change le dossier par défaut affiché par l'installateur).

source: A dynamic variable reference can also take one or more pieces of literal text and the content of one or more variables, and join them together to form a single variable name.
fr: Une référence dynamique de variable peut aussi prendre un ou plus morceaux de texte littéral et le contenu de une ou plus variables, et les relier ensemble pour former le nom d'une variable.

source: A function cannot be defined inside another function.
fr: Une fonction ne peut pas être définie dans une autre fonction.

source: A function is called simply by writing its name followed by its parameters enclosed in parentheses.
fr: Une fonction est appelée en écrivant simplement son nom, suivi de ses paramètres entre parenthèses.

source: A function usually return a value differently than a command does.
fr: Une fonction renvoie habituellement une valeur différemment des commandes.

source: A hotkey is a key that is hot to the touch.
fr: Une hotkey est une key qui est hot.

source: A hotkey is created by using a single pair of colons.
fr: Une hotkey est créée en utilisant une simple paire de deux-points.

source: A hotkey label can be directly followed by a command or other statement to create a one-line hotkey.
fr: Un label hotkey peut être suivi directement par une commande ou autre instruction pour créer une hotkey monoligne.

source: A hotkey with a key name written to the right of the double-colon is actually a remapping, which is shorthand for a pair of hotkeys.
fr: Une hotkey avec un nom de touche écrit à droite du double deux-points est en fait une réaffectation de touches, un raccourci pour une paire de hotkeys.

source: A hotkey's criteria is evaluated each time it is pressed, not when the #If directive is encountered in the code.
fr: Les critères d'une hotkey sont évalués chaque fois qu'elle est enfoncée, pas quand la directive #If est rencontrée dans le code.

source: A hotstring has a pair of colons on each side of the text you want to trigger the text replacement.
fr: Un hotstring a une paire de deux-points de chaque côté du texte qui déclence le remplacement.

source: A hotstring with text written to the right of the final double-colon is an auto-replace hotstring.
fr: Un hotstring avec du texte écrit à droite du double deux-points final est un hostring de remplacement automatique.

source: A label identifies a line of code, and can be used as a Goto target or to form a subroutine.
fr: Un label (étiquette) identifie une ligne de code, et peut être utilisé comme cible pour Goto ou pour former un sous-programme.

source: A line of text.
fr: Une ligne de texte.

source: A line that starts with "and", "or", ||, &&, a comma, or a period is automatically merged with the line directly above it (in v1.0.46+, the same is true for all other expression operators except ++ and --).
fr: Une ligne qui commence par "and", "or", ||, &&, une virgule, ou un point est automatiquement fusionnée avec la ligne directement au-dessus (en v1.0.46+, ceci est aussi vrai pour tous les autres opérateurs d'expression sauf ++ et --).

source: A list of all commands and built-in functions can be found here.
fr: Une liste de toutes les commandes et fonctions intégrées peut être trouvée ici.

source: A literal quotation mark may be passed in by preceding it with a backslash (\").
fr: Un guillemet littéral peut être passé en le précédant d'un antislash (\").

source: A nice thing to know is that you can have many lines of code for each hotkey, hotstring, label, and a lot of other things we haven't talked about yet.
fr: Une information sympathique à connaître est que le nombre de lignes de code pour chaque hotkey n'est pas limité. De même pour les hotstring, label, et plein d'autres choses pas encore abordées.

source: A running script can usually be reloaded via its tray menu.
fr: Un script en cours d'exécution peut habituellement être rechargé via son icône en zone de notification.

source: A script can do as little as performing a single action and then exiting, but most scripts define a number of hotkeys, with each hotkey followed by one or more actions to take when the hotkey is pressed.
fr: Un script peut se contenter d'une action puis de terminer, mais la plupart des scripts définissent un certain nombre de hotkeys (raccourcis clavier...), avec chaque hotkey entraînant une ou plusieurs actions à effectuer quand par exemple une touche est utilisée.

source: A script compiler (courtesy of fincs) is included with the program.
fr: Un compilateur de script (merci à fincs) est inclus avec le programme.

source: A script is simply a plain text file with the .ahk filename extension containing instructions for the program, like a configuration file, but much more powerful.
fr: Un script est un simple fichier texte avec l'extension de fichier .ahk et qui contient des instructions pour le programme, comme un fichier de configuration, mais beaucoup plus puissant.

source: A script may also contain hotkeys and hotstrings, or even consist entirely of them.
fr: Un script peut aussi contenir des hotkeys et des hotstrings, ou même ne contenir que des hotkeys et hostrings.

source: A script that is not persistent and that lacks hotkeys, hotstrings, OnMessage(), and GUI will terminate after the auto-execute section has completed.
fr: Un script qui n'est pas persistant et sans hotkeys, hotstrings, OnMessage(), ni GUI terminera après la fin de la section d'auto-exécution.

source: A similar technique might work in other browsers:
fr: Une technique similaire peut fonctionner dans d'autres navigateurs :

source: A space, tab or comma is required between each command and its parameters.
fr: Un espace, une tabulation ou une virgule est requis entre chaque commande et ses paramètres.

source: A special thanks to Jonathan Bennett, whose generosity in releasing AutoIt v2 as free software in 1999 served as an inspiration and time-saver for myself and many others worldwide.
fr: Un grand merci à Jonathan Bennett, dont la générosité en rendant public gratuitement AutoIt v2 en 1999 a inspiré et fait gagner du temps à moi et beaucoup d'autres à travers le monde.

source: A subroutine has no explicitly marked ending point, but instead ends if and when control is returned to the subroutine's caller by Return or when the thread is exited.
fr: Un sous-programme n'a pas de point de terminaison défini explicitement, mais termine à la place si et quand le contrôle est renvoyé à l'appelant du sous-programme par Return ou quand le fil d'exécution (thread) est terminé.

source: A typical function looks like:
fr: Une fonction typique ressemble à :

source: A value can later be retrieved by its associated key.
fr: Une valeur peut par la suite être récupérée via sa clé associée.

source: A value is assigned to a variable with := instead of =:
fr: Une valeur est affectée à une variable avec := au lieu de = :

source: A value or sub-expression used as input for an operator is called an operand.
fr: Une valeur ou sous-expression utilisée en entrée d'un opérateur est appelée opérande.

source: A window should have popped up, probably Notepad.
fr: Une fenêtre devrait s'ouvrir, probablement Notepad.

source: A workaround is to ensure UIA scripts are loaded last.
fr: Le problème peut être contourné en chargeant les scripts UIA en dernier.

source: A_Index works inside all types of loops, but contains 0 outside of a loop.
fr: A_Index fonctionne dans tous les types de boucle, mais contient 0 hors d'une boucle.

source: A_IsCompiled is always read-only
fr: A_IsCompiled est toujours en lecture seule

source: A_LastError is modified by more commands
fr: A_LastError est modifié par plus de commandes

source: Acknowledgements
fr: Remerciements

source: Additionally in the case of a failure, Ahk2Exe has exit codes indicating the kind of error that occurred.
fr: De plus en cas d'échec, Ahk2Exe a des codes de sortie indiquant le type d'erreur s'étant produite.

source: Additionally, for a list of all/most hotkey names that can be used on the left side of a hotkey's double-colon, see List of Keys, Mouse Buttons, and Joystick Controls.
fr: De plus, pour une liste de tous ou la plupart des noms de hotkey pouvant être utilisés du côté gauche du double-deux-points d'une hotkey, voir Liste des Touches, Boutons de Souris, et Contrôles de Joystick.

source: Additionally, some special characters may need to be escaped or enclosed in braces, depending on the context.
fr: En outre, certains caractères spéciaux doivent être échappés ou placés entre accolades, selon le contexte.

source: Additionally, you cannot do math in the parameters, unlike functions.
fr: De plus, il n'y a pas de calcul possible dans les paramètres, au contraire des fonctions.

source: Advanced
fr: Avancée

source: Advanced Buttons
fr: Boutons Avancés

source: After copying the function into a script or saving it as SendSuppressedKeyUp.ahk in a function library, it can be used as follows:
fr: Après avoir copié la fonction dans un script ou l'avoir enregistrée sous SendSuppressedKeyUp.ahk dans une bibliothèque de fonctions, ceci peut être utilisée comme suit:

source: After creating the default script, launch AutoHotkey via the shortcut in the Start menu to run it.
fr: Après la création du script par défaut, lancer AutoHotkey via le raccourci du menu Démarrer pour l'exécuter.

source: After downloading it, you may possibly need to install it.
fr: Après l'avoir téléchargé, l'installation peut être nécessaire.
